## <font color='blue'>1. Dataframe Definitions

In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
randn(3,3)

array([[ 0.80166305, -0.82313989, -1.50250673],
       [-0.25904318, -0.18274177, -0.15930968],
       [ 0.75124237, -1.98207889,  1.20622059]])

In [4]:
df = pd.DataFrame(data = randn(3,3),index = ["A","B","C"],columns = ["Column1","Column2","Column3"])

In [5]:
df

    Column1   Column2   Column3
A -0.087785 -0.162656  0.620289
B -0.351976 -0.564315  1.003203
C -0.370252 -2.215531  1.055259

##### <font color='blue'>Below filter returns a series</font>

In [6]:
df["Column1"]

A   -0.087785
B   -0.351976
C   -0.370252
Name: Column1, dtype: float64

In [7]:
type(df["Column1"])

pandas.core.series.Series

##### <font color='blue'><p>To list the data of an index, we use loc function.<p>As indexes are used by loc function,  filtering is done on the rows not on the columns.<p>If you want to use both index and columns with loc function you should provide also the column name as in the folowing. <p>df.loc["A","Column1"] </font>

In [8]:
df.loc["A"]

Column1   -0.087785
Column2   -0.162656
Column3    0.620289
Name: A, dtype: float64

In [9]:
type(df.loc["A"])

pandas.core.series.Series

##### <font color='blue'>We can use double [[ ]] to filter the dataframe with more columns</font>

In [10]:
df[["Column1","Column2"]]

    Column1   Column2
A -0.087785 -0.162656
B -0.351976 -0.564315
C -0.370252 -2.215531

##### <font color='blue'>Adding a new column</font>

In [11]:
df["Column4"] = pd.Series(randn(3),index = ["A","B","C"])

In [12]:
df

    Column1   Column2   Column3   Column4
A -0.087785 -0.162656  0.620289 -0.641430
B -0.351976 -0.564315  1.003203 -1.082240
C -0.370252 -2.215531  1.055259 -1.048785

In [13]:
df["Column5"] = df["Column1"] + df["Column2"] + df["Column3"]

In [14]:
df

    Column1   Column2   Column3   Column4   Column5
A -0.087785 -0.162656  0.620289 -0.641430  0.369849
B -0.351976 -0.564315  1.003203 -1.082240  0.086912
C -0.370252 -2.215531  1.055259 -1.048785 -1.530523

##### <font color=blue>Removing a column</font>

In [15]:
df

    Column1   Column2   Column3   Column4   Column5
A -0.087785 -0.162656  0.620289 -0.641430  0.369849
B -0.351976 -0.564315  1.003203 -1.082240  0.086912
C -0.370252 -2.215531  1.055259 -1.048785 -1.530523

In [17]:
df.drop("Column5") # Böyle verirsek default axis değeri 0 olduğu için index silmeye çalışacak.

KeyError: "['Column5'] not found in axis"

In [ ]:
df.drop("Column5",axis = 1)

In [ ]:
df # değişiklikler yansımadı.

In [ ]:
df.drop("Column5",axis = 1,inplace=True)

In [ ]:
df # Değişiklikler yansıdı.

##### <font color=blue> Loc and iLoc functions

In [18]:
df

    Column1   Column2   Column3   Column4   Column5
A -0.087785 -0.162656  0.620289 -0.641430  0.369849
B -0.351976 -0.564315  1.003203 -1.082240  0.086912
C -0.370252 -2.215531  1.055259 -1.048785 -1.530523

In [19]:
df[["Column1","Column2"]]

    Column1   Column2
A -0.087785 -0.162656
B -0.351976 -0.564315
C -0.370252 -2.215531

In [20]:
df.loc["A"]

Column1   -0.087785
Column2   -0.162656
Column3    0.620289
Column4   -0.641430
Column5    0.369849
Name: A, dtype: float64

In [21]:
df.iloc[0] # 0.index yani A

Column1   -0.087785
Column2   -0.162656
Column3    0.620289
Column4   -0.641430
Column5    0.369849
Name: A, dtype: float64

In [22]:
df.loc["A","Column1"] #loc function can be used with both index and column names

-0.08778484530599646

In [23]:
df.loc["B","Column2"]

-0.5643148785800732

In [24]:
df.loc[["A","B"],["Column1","Column2"]]

    Column1   Column2
A -0.087785 -0.162656
B -0.351976 -0.564315

## <font color='blue'>2. Filtering

In [25]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [26]:
df = pd.DataFrame(randn(4,3),["A","B","C","D"],["Column1","Column2","Column3"])

In [27]:
df

    Column1   Column2   Column3
A  0.688068  0.354230 -0.763228
B  0.097740  0.879067  0.038514
C  0.409284  0.469353 -0.632773
D -0.356864 -0.441960  0.455505

In [28]:
df > -1

   Column1  Column2  Column3
A     True     True     True
B     True     True     True
C     True     True     True
D     True     True     True

In [29]:
df[df>-1]

    Column1   Column2   Column3
A  0.688068  0.354230 -0.763228
B  0.097740  0.879067  0.038514
C  0.409284  0.469353 -0.632773
D -0.356864 -0.441960  0.455505

In [30]:
df["Column1"] > 0

A     True
B     True
C     True
D    False
Name: Column1, dtype: bool

In [31]:
df[df["Column1"] > 0]

    Column1   Column2   Column3
A  0.688068  0.354230 -0.763228
B  0.097740  0.879067  0.038514
C  0.409284  0.469353 -0.632773

In [32]:
df[df["Column2"] > 0]

    Column1   Column2   Column3
A  0.688068  0.354230 -0.763228
B  0.097740  0.879067  0.038514
C  0.409284  0.469353 -0.632773

In [33]:
df[(df["Column1"] > 0) & (df["Column2"] > 0)]

    Column1   Column2   Column3
A  0.688068  0.354230 -0.763228
B  0.097740  0.879067  0.038514
C  0.409284  0.469353 -0.632773

In [34]:
df[(df["Column1"] > 0) | (df["Column2"] > 0)]

    Column1   Column2   Column3
A  0.688068  0.354230 -0.763228
B  0.097740  0.879067  0.038514
C  0.409284  0.469353 -0.632773

In [35]:
df

    Column1   Column2   Column3
A  0.688068  0.354230 -0.763228
B  0.097740  0.879067  0.038514
C  0.409284  0.469353 -0.632773
D -0.356864 -0.441960  0.455505

##### <font color='blue'>We are going to add a new column</font>

In [36]:
df["Column4"]= pd.Series(randn(4),["A","B","C","D"])

In [37]:
df

    Column1   Column2   Column3   Column4
A  0.688068  0.354230 -0.763228 -0.639906
B  0.097740  0.879067  0.038514  1.270790
C  0.409284  0.469353 -0.632773 -0.058433
D -0.356864 -0.441960  0.455505 -0.470469

In [38]:
df["Column5"] = randn()

In [39]:
df

    Column1   Column2   Column3   Column4   Column5
A  0.688068  0.354230 -0.763228 -0.639906  1.356588
B  0.097740  0.879067  0.038514  1.270790  1.356588
C  0.409284  0.469353 -0.632773 -0.058433  1.356588
D -0.356864 -0.441960  0.455505 -0.470469  1.356588

In [40]:
df["Column6"] = ["string1","string2","string3","string4"]

In [41]:
df

    Column1   Column2   Column3   Column4   Column5  Column6
A  0.688068  0.354230 -0.763228 -0.639906  1.356588  string1
B  0.097740  0.879067  0.038514  1.270790  1.356588  string2
C  0.409284  0.469353 -0.632773 -0.058433  1.356588  string3
D -0.356864 -0.441960  0.455505 -0.470469  1.356588  string4

##### <font color='blue'>Set your own indexes with set_index()</font>

In [42]:
df.set_index("Column6")

          Column1   Column2   Column3   Column4   Column5
Column6
string1  0.688068  0.354230 -0.763228 -0.639906  1.356588
string2  0.097740  0.879067  0.038514  1.270790  1.356588
string3  0.409284  0.469353 -0.632773 -0.058433  1.356588
string4 -0.356864 -0.441960  0.455505 -0.470469  1.356588

In [43]:
df

    Column1   Column2   Column3   Column4   Column5  Column6
A  0.688068  0.354230 -0.763228 -0.639906  1.356588  string1
B  0.097740  0.879067  0.038514  1.270790  1.356588  string2
C  0.409284  0.469353 -0.632773 -0.058433  1.356588  string3
D -0.356864 -0.441960  0.455505 -0.470469  1.356588  string4

In [44]:
df.set_index("Column6",inplace = True)

In [45]:
df

          Column1   Column2   Column3   Column4   Column5
Column6
string1  0.688068  0.354230 -0.763228 -0.639906  1.356588
string2  0.097740  0.879067  0.038514  1.270790  1.356588
string3  0.409284  0.469353 -0.632773 -0.058433  1.356588
string4 -0.356864 -0.441960  0.455505 -0.470469  1.356588

In [46]:
df.index.names

FrozenList(['Column6'])

In [47]:
df.index

Index(['string1', 'string2', 'string3', 'string4'], dtype='object', name='Column6')

## <font color='blue'> 3. MultiIndexing

In [48]:
outerIndex = ["group1","group1","group1","group2","group2","group2","group3","group3","group3"]

In [49]:
innerIndex = ["Index1","Index2","Index3","Index1","Index2","Index3","Index1","Index2","Index3"]

In [50]:
list(zip(outerIndex,innerIndex))

[('group1', 'Index1'),
 ('group1', 'Index2'),
 ('group1', 'Index3'),
 ('group2', 'Index1'),
 ('group2', 'Index2'),
 ('group2', 'Index3'),
 ('group3', 'Index1'),
 ('group3', 'Index2'),
 ('group3', 'Index3')]

In [51]:
hierarchy = list(zip(outerIndex,innerIndex))

In [52]:
hierarchy = pd.MultiIndex.from_tuples(hierarchy)

In [53]:
hierarchy

MultiIndex([('group1', 'Index1'),
            ('group1', 'Index2'),
            ('group1', 'Index3'),
            ('group2', 'Index1'),
            ('group2', 'Index2'),
            ('group2', 'Index3'),
            ('group3', 'Index1'),
            ('group3', 'Index2'),
            ('group3', 'Index3')],
           )

In [54]:
df = pd.DataFrame(randn(9,3),hierarchy,columns=["Column1","Column2","Column3"])

In [55]:
df

                Column1   Column2   Column3
group1 Index1 -0.111759 -1.075559 -1.627092
       Index2  0.297418  0.863017  0.389893
       Index3  0.965636 -0.826365  0.066878
group2 Index1  0.683010  1.683105  0.192540
       Index2  0.756150 -0.273857  0.237619
       Index3 -1.420244 -0.821924 -0.417961
group3 Index1 -1.360599 -0.631117  0.690511
       Index2 -0.214859 -0.260300 -1.004879
       Index3 -2.056504 -1.795741 -0.273701

In [56]:
df["Column1"]

group1  Index1   -0.111759
        Index2    0.297418
        Index3    0.965636
group2  Index1    0.683010
        Index2    0.756150
        Index3   -1.420244
group3  Index1   -1.360599
        Index2   -0.214859
        Index3   -2.056504
Name: Column1, dtype: float64

In [57]:
df.loc["group1"]

         Column1   Column2   Column3
Index1 -0.111759 -1.075559 -1.627092
Index2  0.297418  0.863017  0.389893
Index3  0.965636 -0.826365  0.066878

In [58]:
df.loc[["group1","group2"]]

                Column1   Column2   Column3
group1 Index1 -0.111759 -1.075559 -1.627092
       Index2  0.297418  0.863017  0.389893
       Index3  0.965636 -0.826365  0.066878
group2 Index1  0.683010  1.683105  0.192540
       Index2  0.756150 -0.273857  0.237619
       Index3 -1.420244 -0.821924 -0.417961

In [59]:
df.loc["group1"].loc["Index1"]

Column1   -0.111759
Column2   -1.075559
Column3   -1.627092
Name: Index1, dtype: float64

In [60]:
df

                Column1   Column2   Column3
group1 Index1 -0.111759 -1.075559 -1.627092
       Index2  0.297418  0.863017  0.389893
       Index3  0.965636 -0.826365  0.066878
group2 Index1  0.683010  1.683105  0.192540
       Index2  0.756150 -0.273857  0.237619
       Index3 -1.420244 -0.821924 -0.417961
group3 Index1 -1.360599 -0.631117  0.690511
       Index2 -0.214859 -0.260300 -1.004879
       Index3 -2.056504 -1.795741 -0.273701

In [61]:
df.index.names

FrozenList([None, None])

In [62]:
df.index.names = ["Outer","Inner"]

In [63]:
df

                Column1   Column2   Column3
Outer  Inner
group1 Index1 -0.111759 -1.075559 -1.627092
       Index2  0.297418  0.863017  0.389893
       Index3  0.965636 -0.826365  0.066878
group2 Index1  0.683010  1.683105  0.192540
       Index2  0.756150 -0.273857  0.237619
       Index3 -1.420244 -0.821924 -0.417961
group3 Index1 -1.360599 -0.631117  0.690511
       Index2 -0.214859 -0.260300 -1.004879
       Index3 -2.056504 -1.795741 -0.273701

In [64]:
df.xs("group1")

         Column1   Column2   Column3
Inner
Index1 -0.111759 -1.075559 -1.627092
Index2  0.297418  0.863017  0.389893
Index3  0.965636 -0.826365  0.066878

In [65]:
df.xs("group1").xs("Index2").xs("Column1")

0.29741836395206034

In [66]:
df.xs("Index1",level = "Inner")

         Column1   Column2   Column3
Outer
group1 -0.111759 -1.075559 -1.627092
group2  0.683010  1.683105  0.192540
group3 -1.360599 -0.631117  0.690511

## <font color='blue'> 4. Missing or Corrupted Data

##### <font color='blue'>Preprocessing

In [67]:
arr = np.array([[10,20,np.nan],[5,np.nan,np.nan],[21,np.nan,10]])

In [68]:
arr

array([[10., 20., nan],
       [ 5., nan, nan],
       [21., nan, 10.]])

In [69]:
df = pd.DataFrame(arr,index = ["Index1","Index2","Index3"],columns = ["Column1","Column2","Column3"])

In [70]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [71]:
df.dropna(axis = 1) #axis = 0 means x axis, axis = 1 means column

        Column1
Index1     10.0
Index2      5.0
Index3     21.0

In [72]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [73]:
df.dropna(thresh = 2) #if there are 2 data which are not na then it will not delete that x axis

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index3     21.0      NaN     10.0

In [74]:
df.fillna(value = 1) #na replaces with 1

        Column1  Column2  Column3
Index1     10.0     20.0      1.0
Index2      5.0      1.0      1.0
Index3     21.0      1.0     10.0

In [75]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [76]:
df.size  #amount of the data

9

In [77]:
df.isnull().sum().sum() #amount of the na

4

<font color = green>Lets calculate avarage values of the dataframe</font>

In [78]:
def calculateMean(df):
    totalSum = df.sum().sum()
    totalNum = df.size - df.isnull().sum().sum()
    return totalSum/totalNum

In [79]:
calculateMean(df)

13.2

In [80]:
df.fillna(value = calculateMean(df))

        Column1  Column2  Column3
Index1     10.0     20.0     13.2
Index2      5.0     13.2     13.2
Index3     21.0     13.2     10.0

In [81]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [82]:
df.fillna(value = calculateMean(df), inplace = True)

In [83]:
df

        Column1  Column2  Column3
Index1     10.0     20.0     13.2
Index2      5.0     13.2     13.2
Index3     21.0     13.2     10.0

## <font color='blue'> 5. Groupby Operations

In [84]:
import numpy as np
import pandas as pd

In [85]:
dataset = {
        "Departmant":["IT","HR","Production","Production","IT","HR"],
        "Employee": ["Hans","Jullie","Peter","Tom","Ton","Frank"],
        "Salary":[3000,3500,2500,4500,4000,2000]
        }

In [86]:
df = pd.DataFrame(dataset)

In [87]:
df

   Departmant Employee  Salary
0          IT     Hans    3000
1          HR   Jullie    3500
2  Production    Peter    2500
3  Production      Tom    4500
4          IT      Ton    4000
5          HR    Frank    2000

In [92]:
df.groupby("Departmant").sum()

            Salary
Departmant
HR            5500
IT            7000
Production    7000

In [98]:
df.groupby("Departmant").sum().loc["HR"]

Salary    5500
Name: HR, dtype: int64

In [99]:
int(df.groupby("Departmant").sum().loc["HR"])

5500

In [101]:
df.groupby("Departmant").count()  #count total employee amount

            Employee  Salary
Departmant
HR                 2       2
IT                 2       2
Production         2       2

In [102]:
df.groupby("Departmant").max()

           Employee  Salary
Departmant
HR           Jullie    3500
IT              Ton    4000
Production      Tom    4500

In [103]:
df.groupby("Departmant").min()

           Employee  Salary
Departmant
HR            Frank    2000
IT             Hans    3000
Production    Peter    2500

In [104]:
df.groupby("Departmant").min()["Employee"] #[] bracket are used for columns

Departmant
HR            Frank
IT             Hans
Production    Peter
Name: Employee, dtype: object

In [105]:
df.groupby("Departmant").min()["Employee"]["IT"]

'Hans'

In [106]:
df.groupby("Departmant").mean()

            Salary
Departmant
HR            2750
IT            3500
Production    3500

In [110]:
df.groupby("Departmant").mean()["Salary"]["IT"]   #["IT"] or .xs("IT") both works

3500

## <font color='blue'> 6. Merge,Join,Concatenate

##### <font color='blue'>Concatenate</font>

In [111]:
dataset1 = {
    "A": ["A1","A2","A3","A4"],
    "B":["B1","B2","B3","B4"],
    "C":["C1","C2","C3","C4"],
}

In [112]:
dataset2 = {
    "A": ["A5","A6","A7","A8"],
    "B":["B5","B6","B7","B8"],
    "C":["C5","C6","C7","C8"],
}

In [115]:
df1 = pd.DataFrame(dataset1,index = [1,2,3,4])

In [116]:
df1

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4

In [117]:
df2 = pd.DataFrame(dataset2,index = [5,6,7,8])

In [118]:
df2

    A   B   C
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [119]:
pd.concat([df1,df2])

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [120]:
pd.concat([df1,df2],axis=1)

     A    B    C    A    B    C
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3   A3   B3   C3  NaN  NaN  NaN
4   A4   B4   C4  NaN  NaN  NaN
5  NaN  NaN  NaN   A5   B5   C5
6  NaN  NaN  NaN   A6   B6   C6
7  NaN  NaN  NaN   A7   B7   C7
8  NaN  NaN  NaN   A8   B8   C8

##### <font color='blue'>Join</font>

In [121]:
dataset1 = {
    "A": ["A1","A2","A3","A4"],
    "B": ["B1","B2","B3","B4"],
}

In [124]:
df1 = pd.DataFrame(dataset1,index = [1,2,3,4])

In [125]:
df1

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [126]:
dataset2 = {
    "X": ["X1","X2","X3"],
    "Y":["Y1","Y2","Y3"],
}

In [128]:
df2=pd.DataFrame(dataset2,index=[1,2,3])

In [129]:
df2

    X   Y
1  X1  Y1
2  X2  Y2
3  X3  Y3

In [130]:
df1.join(df2)

    A   B    X    Y
1  A1  B1   X1   Y1
2  A2  B2   X2   Y2
3  A3  B3   X3   Y3
4  A4  B4  NaN  NaN

In [131]:
df2.join(df1)

    X   Y   A   B
1  X1  Y1  A1  B1
2  X2  Y2  A2  B2
3  X3  Y3  A3  B3

##### <font color='blue'>Merge</font>

Merge is used with columns and it is like inner join

In [146]:
dataset1 = {
    "A" : ["A1","A2","A3"],
    "B" : ["B1","B2","B3"],
    "shared" : ["K1","K2","K3"],
}

In [147]:
df1 = pd.DataFrame(dataset1,index=[1,2,3])

In [148]:
df1

    A   B shared
1  A1  B1     K1
2  A2  B2     K2
3  A3  B3     K3

In [149]:
dataset2 = {
    "X" : ["X1","X2","X3","X4"],
    "Y" : ["Y1","Y2","Y3","Y4"],
    "shared" : ["K1","K2","K5","K4"]
}

In [150]:
df2 = pd.DataFrame(dataset2,index=[1,2,3,4])

In [151]:
df2

    X   Y shared
1  X1  Y1     K1
2  X2  Y2     K2
3  X3  Y3     K5
4  X4  Y4     K4

In [152]:
pd.merge(df1,df2,on="shared")

    A   B shared   X   Y
0  A1  B1     K1  X1  Y1
1  A2  B2     K2  X2  Y2

## <font color='blue'> 7. Pivot and other Operations</font>

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
    "Column1":[1,2,3,4,5,6],
    "Column2":[100,100,200,300,300,100],
    "Column3":["person1","person2","person3","person4","person5","person6"]
})

In [3]:
df

   Column1  Column2  Column3
0        1      100  person1
1        2      100  person2
2        3      200  person3
3        4      300  person4
4        5      300  person5
5        6      100  person6

In [4]:
df["Column2"].unique()

array([100, 200, 300], dtype=int64)

In [5]:
df["Column2"].nunique()

3

In [6]:
df["Column2"].value_counts()

100    3
300    2
200    1
Name: Column2, dtype: int64

In [8]:
df[(df["Column1"] >=4) & (df["Column2"] == 300)]

   Column1  Column2  Column3
3        4      300  person4
4        5      300  person5

In [11]:
def times3(x):
    return x*3

In [13]:
df["Column2"] = df["Column2"].apply(times3)

In [14]:
df

   Column1  Column2  Column3
0        1      300  person1
1        2      300  person2
2        3      600  person3
3        4      900  person4
4        5      900  person5
5        6      300  person6

In [17]:
df["Column2"].apply(lambda x : x*2)

0     600
1     600
2    1200
3    1800
4    1800
5     600
Name: Column2, dtype: int64

In [18]:
df["Column3"].apply(len)

0    7
1    7
2    7
3    7
4    7
5    7
Name: Column3, dtype: int64

In [19]:
df.drop("Column3",axis=1)

   Column1  Column2
0        1      300
1        2      300
2        3      600
3        4      900
4        5      900
5        6      300

In [20]:
df

   Column1  Column2  Column3
0        1      300  person1
1        2      300  person2
2        3      600  person3
3        4      900  person4
4        5      900  person5
5        6      300  person6

In [21]:
df.drop("Column3",axis=1,inplace = True)

In [22]:
df

   Column1  Column2
0        1      300
1        2      300
2        3      600
3        4      900
4        5      900
5        6      300

In [23]:
df.columns

Index(['Column1', 'Column2'], dtype='object')

In [24]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [25]:
len(df.index)

6

In [27]:
df.sort_values("Column2",ascending=False)

   Column1  Column2
3        4      900
4        5      900
2        3      600
0        1      300
1        2      300
5        6      300

In [29]:
df = pd.DataFrame({
    "Month" : ["March","April","May","March","April","May","March","April","May"],
    "City":["Lisbon","Lisbon","Lisbon","Milano","Milano","Milano","Antwerp","Antwerp","Antwerp"],
    "Hummidity":[10,25,50,21,67,80,30,70,75]
})

In [30]:
df

   Month     City  Hummidity
0  March   Lisbon         10
1  April   Lisbon         25
2    May   Lisbon         50
3  March   Milano         21
4  April   Milano         67
5    May   Milano         80
6  March  Antwerp         30
7  April  Antwerp         70
8    May  Antwerp         75

In [31]:
df.pivot_table(index="Month",columns="City",values="Hummidity")

City   Antwerp  Lisbon  Milano
Month
April       70      25      67
March       30      10      21
May         75      50      80

In [32]:
df.pivot_table(index="City",columns="Month",values="Hummidity")

Month    April  March  May
City
Antwerp     70     30   75
Lisbon      25     10   50
Milano      67     21   80

## <font color='blue'> 8. Reading a Dataset</font>

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("USvideos.csv")

In [3]:
df

,video_id,trending_date,title,channel_title,category_id,publish_time,tags,views,likes,dislikes,comment_count,thumbnail_link,comments_disabled,ratings_disabled,video_error_or_removed,description
0,2kyS6SvSYSE,17.14.11,WE WANT TO TALK ABOUT OUR MARRIAGE,CaseyNeistat,22,2017-11-13T17:13:01.000Z,SHANtell martin,748374,57527,2966,15954,https://i.ytimg.com/vi/2kyS6SvSYSE/default.jpg,False,False,False,SHANTELL'S CHANNEL - https://www.youtube.com/s...
1,1ZAPwfrtAFY,17.14.11,The Trump Presidency: Last Week Tonight with J...,LastWeekTonight,24,2017-11-13T07:30:00.000Z,"last week tonight trump presidency|""last week ...",2418783,97185,6146,12703,https://i.ytimg.com/vi/1ZAPwfrtAFY/default.jpg,False,False,False,"One year after the presidential election, John..."
2,5qpjK5DgCt4,17.14.11,"Racist Superman | Rudy Mancuso, King Bach & Le...",Rudy Mancuso,23,2017-11-12T19:05:24.000Z,"racist superman|""rudy""|""mancuso""|""king""|""bach""...",3191434,146033,5339,8181,https://i.ytimg.com/vi/5qpjK5DgCt4/default.jpg,False,False,False,WATCH MY PREVIOUS VIDEO ▶ \n\nSUBSCRIBE ► http...
3,puqaWrEC7tY,17.14.11,Nickelback Lyrics: Real or Fake?,Good Mythical Morning,24,2017-11-13T11:00:04.000Z,"rhett and link|""gmm""|""good mythical morning""|""...",343168,10172,666,2146,https://i.ytimg.com/vi/puqaWrEC7tY/default.jpg,False,False,False,Today we find out if Link is a Nickelback amat...
4,d380meD0W0M,17.14.11,I Dare You: GOING BALD!?,nigahiga,24,2017-11-12T18:01:41.000Z,"ryan|""higa""|""higatv""|""nigahiga""|""i dare you""|""...",2095731,132235,1989,17518,https://i.ytimg.com/vi/d380meD0W0M/default.jpg,False,False,False,I know it's been a while since we did this sho...
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
23357,pH7VfJDq7f4,18.12.03,Why Bridges Move...,Practical Engineering,27,2018-02-27T12:00:08.000Z,"thermal expansion|""expansion joint""|""thermal m...",456470,14826,279,820,https://i.ytimg.com/vi/pH7VfJDq7f4/default.jpg,False,False,False,...and other musings on thermal movement of la...
23358,hV-yHbbrKRA,18.12.03,Macaroni - A Recipe From 1784,Townsends,27,2018-02-26T21:23:39.000Z,"townsends|""jas townsend and son""|""reenacting""|...",519220,13600,329,1350,https://i.ytimg.com/vi/hV-yHbbrKRA/default.jpg,False,False,False,Visit Our Website! ▶ http://www.townsends.us/ ...
23359,CwKp6Xhy3_4,18.12.03,Chris Young - Hangin' On,ChrisYoungVEVO,10,2018-02-26T08:00:02.000Z,"Losing sleep video|""losing sleep album""|""think...",1117570,7504,584,324,https://i.ytimg.com/vi/CwKp6Xhy3_4/default.jpg,False,False,False,Chris Young's Hangin' On from his #1 album Los...
23360,vQiiNGllGQo,18.12.03,Elderly man making sure his dog won't get wet,"Rock me, Joey Santiago.",15,2018-02-26T11:09:32.000Z,"dog|""cute""|""adorable""|""doggo""|""doge""|""old""|""ma...",713574,12448,146,1474,https://i.ytimg.com/vi/vQiiNGllGQo/default.jpg,False,False,False,very wholesome stuff.\n\nThis video was taken ...
23361,2afSbqlp5HU,18.12.03,How to speak like Black Panther - BBC News,BBC News,1,2018-02-27T12:26:49.000Z,"bbc|""bbc news""|""news""|""black panther""|""black p...",422979,7408,1344,1548,https://i.ytimg.com/vi/2afSbqlp5HU/default.jpg,False,False,False,The new marvel film Black Panther is set in th...

In [4]:
newdataset1 = df.drop(["video_id","trending_date"],axis=1)

In [5]:
newdataset1

,title,channel_title,category_id,publish_time,tags,views,likes,dislikes,comment_count,thumbnail_link,comments_disabled,ratings_disabled,video_error_or_removed,description
0,WE WANT TO TALK ABOUT OUR MARRIAGE,CaseyNeistat,22,2017-11-13T17:13:01.000Z,SHANtell martin,748374,57527,2966,15954,https://i.ytimg.com/vi/2kyS6SvSYSE/default.jpg,False,False,False,SHANTELL'S CHANNEL - https://www.youtube.com/s...
1,The Trump Presidency: Last Week Tonight with J...,LastWeekTonight,24,2017-11-13T07:30:00.000Z,"last week tonight trump presidency|""last week ...",2418783,97185,6146,12703,https://i.ytimg.com/vi/1ZAPwfrtAFY/default.jpg,False,False,False,"One year after the presidential election, John..."
2,"Racist Superman | Rudy Mancuso, King Bach & Le...",Rudy Mancuso,23,2017-11-12T19:05:24.000Z,"racist superman|""rudy""|""mancuso""|""king""|""bach""...",3191434,146033,5339,8181,https://i.ytimg.com/vi/5qpjK5DgCt4/default.jpg,False,False,False,WATCH MY PREVIOUS VIDEO ▶ \n\nSUBSCRIBE ► http...
3,Nickelback Lyrics: Real or Fake?,Good Mythical Morning,24,2017-11-13T11:00:04.000Z,"rhett and link|""gmm""|""good mythical morning""|""...",343168,10172,666,2146,https://i.ytimg.com/vi/puqaWrEC7tY/default.jpg,False,False,False,Today we find out if Link is a Nickelback amat...
4,I Dare You: GOING BALD!?,nigahiga,24,2017-11-12T18:01:41.000Z,"ryan|""higa""|""higatv""|""nigahiga""|""i dare you""|""...",2095731,132235,1989,17518,https://i.ytimg.com/vi/d380meD0W0M/default.jpg,False,False,False,I know it's been a while since we did this sho...
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
23357,Why Bridges Move...,Practical Engineering,27,2018-02-27T12:00:08.000Z,"thermal expansion|""expansion joint""|""thermal m...",456470,14826,279,820,https://i.ytimg.com/vi/pH7VfJDq7f4/default.jpg,False,False,False,...and other musings on thermal movement of la...
23358,Macaroni - A Recipe From 1784,Townsends,27,2018-02-26T21:23:39.000Z,"townsends|""jas townsend and son""|""reenacting""|...",519220,13600,329,1350,https://i.ytimg.com/vi/hV-yHbbrKRA/default.jpg,False,False,False,Visit Our Website! ▶ http://www.townsends.us/ ...
23359,Chris Young - Hangin' On,ChrisYoungVEVO,10,2018-02-26T08:00:02.000Z,"Losing sleep video|""losing sleep album""|""think...",1117570,7504,584,324,https://i.ytimg.com/vi/CwKp6Xhy3_4/default.jpg,False,False,False,Chris Young's Hangin' On from his #1 album Los...
23360,Elderly man making sure his dog won't get wet,"Rock me, Joey Santiago.",15,2018-02-26T11:09:32.000Z,"dog|""cute""|""adorable""|""doggo""|""doge""|""old""|""ma...",713574,12448,146,1474,https://i.ytimg.com/vi/vQiiNGllGQo/default.jpg,False,False,False,very wholesome stuff.\n\nThis video was taken ...
23361,How to speak like Black Panther - BBC News,BBC News,1,2018-02-27T12:26:49.000Z,"bbc|""bbc news""|""news""|""black panther""|""black p...",422979,7408,1344,1548,https://i.ytimg.com/vi/2afSbqlp5HU/default.jpg,False,False,False,The new marvel film Black Panther is set in th...

In [9]:
newdataset1.to_csv("usvideos_dropnew.csv",index=False)

##### <font color='blue'> Read Excell</font>

In [10]:
excelset = pd.read_excel("excelfile.xlsx")

In [11]:
excelset

  Unnamed: 0  Column1  Column2  Column3  Column4
0     Index1       10       50       90      130
1     Index2       20       60      100      140
2     Index3       30       70      110      150
3     Index4       40       80      120      160

In [12]:
excelset["Column5"] = ["1","2","3","4"]

In [13]:
excelset

  Unnamed: 0  Column1  Column2  Column3  Column4 Column5
0     Index1       10       50       90      130       1
1     Index2       20       60      100      140       2
2     Index3       30       70      110      150       3
3     Index4       40       80      120      160       4

In [14]:
excelset.to_excel("excelfile_new.xls")

##### <font color='blue'> Read HTML</font>

In [18]:
new = pd.read_html("https://www.contextures.com/xlSampleData01.html", header = 0)

In [19]:
new

[     OrderDate   Region       Rep     Item  Units  UnitCost    Total
 0     1/6/2019     East     Jones   Pencil     95      1.99   189.05
 1    1/23/2019  Central    Kivell   Binder     50     19.99   999.50
 2     2/9/2019  Central   Jardine   Pencil     36      4.99   179.64
 3    2/26/2019  Central      Gill      Pen     27     19.99   539.73
 4    3/15/2019     West   Sorvino   Pencil     56      2.99   167.44
 5     4/1/2019     East     Jones   Binder     60      4.99   299.40
 6    4/18/2019  Central   Andrews   Pencil     75      1.99   149.25
 7     5/5/2019  Central   Jardine   Pencil     90      4.99   449.10
 8    5/22/2019     West  Thompson   Pencil     32      1.99    63.68
 9     6/8/2019     East     Jones   Binder     60      8.99   539.40
 10   6/25/2019  Central    Morgan   Pencil     90      4.99   449.10
 11   7/12/2019     East    Howard   Binder     29      1.99    57.71
 12   7/29/2019     East    Parent   Binder     81     19.99  1619.19
 13   8/15/2019     East     Jones   Pencil     35      4.99   174.65
 14    9/1/2019  Central     Smith     Desk      2    125.00   250.00
 15   9/18/2019     East     Jones  Pen Set     16     15.99   255.84
 16   10/5/2019  Central    Morgan   Binder     28      8.99   251.72
 17  10/22/2019     East     Jones      Pen     64      8.99   575.36
 18   11/8/2019     East    Parent      Pen     15     19.99   299.85
 19  11/25/2019  Central    Kivell  Pen Set     96      4.99   479.04
 20  12/12/2019  Central     Smith   Pencil     67      1.29    86.43
 21  12/29/2019     East    Parent  Pen Set     74     15.99  1183.26
 22   1/15/2020  Central      Gill   Binder     46      8.99   413.54
 23    2/1/2020  Central     Smith   Binder     87     15.00  1305.00
 24   2/18/2020     East     Jones   Binder      4      4.99    19.96
 25    3/7/2020     West   Sorvino   Binder      7     19.99   139.93
 26   3/24/2020  Central   Jardine  Pen Set     50      4.99   249.50
 27   4/10/2020  Central   Andrews   Pencil     66      1.99   131.34
 28   4/27/2020     East    Howard      Pen     96      4.99   479.04
 29   5/14/2020  Central      Gill   Pencil     53      1.29    68.37
 30   5/31/2020  Central      Gill   Binder     80      8.99   719.20
 31   6/17/2020  Central    Kivell     Desk      5    125.00   625.00
 32    7/4/2020     East     Jones  Pen Set     62      4.99   309.38
 33   7/21/2020  Central    Morgan  Pen Set     55     12.49   686.95
 34    8/7/2020  Central    Kivell  Pen Set     42     23.95  1005.90
 35   8/24/2020     West   Sorvino     Desk      3    275.00   825.00
 36   9/10/2020  Central      Gill   Pencil      7      1.29     9.03
 37   9/27/2020     West   Sorvino      Pen     76      1.99   151.24
 38  10/14/2020     West  Thompson   Binder     57     19.99  1139.43
 39  10/31/2020  Central   Andrews   Pencil     14      1.29    18.06
 40  11/17/2020  Central   Jardine   Binder     11      4.99    54.89
 41   12/4/2020  Central   Jardine   Binder     94     19.99  1879.06
 42  12/21/2020  Central   Andrews   Binder     28      4.99   139.72]

In [20]:
new[0]

     OrderDate   Region       Rep     Item  Units  UnitCost    Total
0     1/6/2019     East     Jones   Pencil     95      1.99   189.05
1    1/23/2019  Central    Kivell   Binder     50     19.99   999.50
2     2/9/2019  Central   Jardine   Pencil     36      4.99   179.64
3    2/26/2019  Central      Gill      Pen     27     19.99   539.73
4    3/15/2019     West   Sorvino   Pencil     56      2.99   167.44
5     4/1/2019     East     Jones   Binder     60      4.99   299.40
6    4/18/2019  Central   Andrews   Pencil     75      1.99   149.25
7     5/5/2019  Central   Jardine   Pencil     90      4.99   449.10
8    5/22/2019     West  Thompson   Pencil     32      1.99    63.68
9     6/8/2019     East     Jones   Binder     60      8.99   539.40
10   6/25/2019  Central    Morgan   Pencil     90      4.99   449.10
11   7/12/2019     East    Howard   Binder     29      1.99    57.71
12   7/29/2019     East    Parent   Binder     81     19.99  1619.19
13   8/15/2019     East     Jones   Pencil     35      4.99   174.65
14    9/1/2019  Central     Smith     Desk      2    125.00   250.00
15   9/18/2019     East     Jones  Pen Set     16     15.99   255.84
16   10/5/2019  Central    Morgan   Binder     28      8.99   251.72
17  10/22/2019     East     Jones      Pen     64      8.99   575.36
18   11/8/2019     East    Parent      Pen     15     19.99   299.85
19  11/25/2019  Central    Kivell  Pen Set     96      4.99   479.04
20  12/12/2019  Central     Smith   Pencil     67      1.29    86.43
21  12/29/2019     East    Parent  Pen Set     74     15.99  1183.26
22   1/15/2020  Central      Gill   Binder     46      8.99   413.54
23    2/1/2020  Central     Smith   Binder     87     15.00  1305.00
24   2/18/2020     East     Jones   Binder      4      4.99    19.96
25    3/7/2020     West   Sorvino   Binder      7     19.99   139.93
26   3/24/2020  Central   Jardine  Pen Set     50      4.99   249.50
27   4/10/2020  Central   Andrews   Pencil     66      1.99   131.34
28   4/27/2020     East    Howard      Pen     96      4.99   479.04
29   5/14/2020  Central      Gill   Pencil     53      1.29    68.37
30   5/31/2020  Central      Gill   Binder     80      8.99   719.20
31   6/17/2020  Central    Kivell     Desk      5    125.00   625.00
32    7/4/2020     East     Jones  Pen Set     62      4.99   309.38
33   7/21/2020  Central    Morgan  Pen Set     55     12.49   686.95
34    8/7/2020  Central    Kivell  Pen Set     42     23.95  1005.90
35   8/24/2020     West   Sorvino     Desk      3    275.00   825.00
36   9/10/2020  Central      Gill   Pencil      7      1.29     9.03
37   9/27/2020     West   Sorvino      Pen     76      1.99   151.24
38  10/14/2020     West  Thompson   Binder     57     19.99  1139.43
39  10/31/2020  Central   Andrews   Pencil     14      1.29    18.06
40  11/17/2020  Central   Jardine   Binder     11      4.99    54.89
41   12/4/2020  Central   Jardine   Binder     94     19.99  1879.06
42  12/21/2020  Central   Andrews   Binder     28      4.99   139.72